tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/Cygnal/C8051F580.h
//-----------------------------------------------------------------------------
// Page C (CAN0) Registers
//-----------------------------------------------------------------------------

SFR (CAN0CFG, 0x92);                   // CAN0 Clock Configuration
SFR (CAN0STAT, 0x94);                  // Status Register Low Byte
SFR (CAN0ERRL, 0x96);                  // Error Counter Low Byte
SFR (CAN0ERRH, 0x97);                  // Error Counter High Byte
SFR (CAN0BTL, 0x9A);                   // Bit Timing Register Low Byte
SFR (CAN0BTH, 0x9B);                   // Bit Timing Register High Byte
SFR (CAN0IIDL, 0x9C);                  // Interrupt Register Low Byte
SFR (CAN0IIDH, 0x9D);                  // Interrupt Register High Byte
SFR (CAN0TST, 0x9E);                   // Test Register Low Byte
SFR (CAN0BRPE, 0xA1);                  // BRP Extension Register Low Byte
SFR (CAN0TR1L, 0xA2);                  // Transmission Request 1 Low Byte
SFR (CAN0TR1H, 0xA3);                  // Transmission Request 1 High Byte
SFR (CAN0TR2L, 0xA4);                  // Transmission Request 2 Low Byte
SFR (CAN0TR2H, 0xA5);                  // Transmission Request 2 High Byte
SFR (CAN0ND1L, 0xAA);                  // New Data 1 Low Byte
SFR (CAN0ND1H, 0xAB);                  // New Data 1 High Byte
SFR (CAN0ND2L, 0xAC);                  // New Data 2 Low Byte
SFR (CAN0ND2H, 0xAD);                  // New Data 2 High Byte
SFR (CAN0IP1L, 0xAE);                  // Interrupt Pending 1 Low Byte
SFR (CAN0IP1H, 0xAF);                  // Interrupt Pending 1 High Byte
SFR (CAN0IP2L, 0xB2);                  // Interrupt Pending 2 Low Byte
SFR (CAN0IP2H, 0xB3);                  // Interrupt Pending 2 High Byte
SFR (CAN0MV1L, 0xBA);                  // Message Valid 1 Low Byte
SFR (CAN0MV1H, 0xBB);                  // Message Valid 1 High Byte
SFR (CAN0MV2L, 0xBC);                  // Message Valid 2 Low Byte
SFR (CAN0MV2H, 0xBD);                  // Message Valid 2 High Byte
SFR (CAN0IF1CRL, 0xBE);                // IF1 Command Request Low Byte
SFR (CAN0IF1CRH, 0xBF);                // IF1 Command Request High Byte
SFR (CAN0CN, 0xC0);                    // CAN Control Register Low Byte
SFR (CAN0IF1CML, 0xC2);                // IF1 Command Mask Low Byte
SFR (CAN0IF1CMH, 0xC3);                // IF1 Command Mask High Byte
SFR (CAN0IF1M1L, 0xC4);                // IF1 Mask 1 Low Byte
SFR (CAN0IF1M1H, 0xC5);                // IF1 Mask 1 High Byte
SFR (CAN0IF1M2L, 0xC6);                // IF1 Mask 2 Low Byte
SFR (CAN0IF1M2H, 0xC7);                // IF1 Mask 2 High Byte
SFR (CAN0IF1A1L, 0xCA);                // IF1 Arbitration 1 Low Byte
SFR (CAN0IF1A1H, 0xCB);                // IF1 Arbitration 1 High Byte
SFR (CAN0IF1A2L, 0xCC);                // IF1 Arbitration 2 Low Byte
SFR (CAN0IF1A2H, 0xCD);                // IF1 Arbitration 2 High Byte
SFR (CAN0IF2MCL, 0xCE);                // IF2 Message Control Low Byte
SFR (CAN0IF2MCH, 0xCF);                // IF2 Message Control High Byte
SFR (CAN0IF1MCL, 0xD2);                // IF1 Message Control Low Byte
SFR (CAN0IF1MCH, 0xD3);                // IF1 Message Control High Byte
SFR (CAN0IF1DA1L, 0xD4);               // IF1 Data A 1 Low Byte
SFR (CAN0IF1DA1H, 0xD5);               // IF1 Data A 1 High Byte
SFR (CAN0IF1DA2L, 0xD6);               // IF1 Data A 2 Low Byte
SFR (CAN0IF1DA2H, 0xD7);               // IF1 Data A 2 High Byte
SFR (CAN0IF1DB1L, 0xDA);               // IF1 Data B 1 Low Byte
SFR (CAN0IF1DB1H, 0xDB);               // IF1 Data B 1 High Byte
SFR (CAN0IF1DB2L, 0xDC);               // IF1 Data B 2 Low Byte
SFR (CAN0IF1DB2H, 0xDD);               // IF1 Data B 2 High Byte
SFR (CAN0IF2CRL, 0xDE);                // IF2 Command Request Low Byte
SFR (CAN0IF2CRH, 0xDF);                // IF2 Command Request High Byte
SFR (CAN0IF2CML, 0xE2);                // IF2 Command Mask Low Byte
SFR (CAN0IF2CMH, 0xE3);                // IF2 Command Mask High Byte
SFR (CAN0IF2M1L, 0xEA);                // IF2 Mask 1 Low Byte
SFR (CAN0IF2M1H, 0xEB);                // IF2 Mask 1 High Byte
SFR (CAN0IF2M2L, 0xEC);                // IF2 Mask 2 Low Byte
SFR (CAN0IF2M2H, 0xED);                // IF2 Mask 2 High Byte
SFR (CAN0IF2A1L, 0xEE);                // IF2 Arbitration 1 Low Byte
SFR (CAN0IF2A1H, 0xEF);                // IF2 Arbitration 1 High Byte
SFR (CAN0IF2A2L, 0xF2);                // IF2 Arbitration 2 Low Byte
SFR (CAN0IF2A2H, 0xF3);                // IF2 Arbitration 2 High Byte
SFR (CAN0IF2DA1L, 0xF6);               // IF2 Data A 1 Low Byte
SFR (CAN0IF2DA1H, 0xF7);               // IF2 Data A 1 High Byte
SFR (CAN0IF2DA2L, 0xFA);               // IF2 Data A 2 Low Byte
SFR (CAN0IF2DA2H, 0xFB);               // IF2 Data A 2 High Byte
SFR (CAN0IF2DB1L, 0xFC);               // IF2 Data B 1 Low Byte
SFR (CAN0IF2DB1H, 0xFD);               // IF2 Data B 1 High Byte
SFR (CAN0IF2DB2L, 0xFE);               // IF2 Data B 2 Low Byte
SFR (CAN0IF2DB2H, 0xFF);               // IF2 Data B 2 High Byte


//-----------------------------------------------------------------------------
// 16-bit Register Definitions (might not be supported by all compilers)
//-----------------------------------------------------------------------------

SFR16 (DP, 0x82);                      // Data Pointer
SFR16 (TMR3RL, 0x92);                  // Timer 3 Reload
SFR16 (TMR5CAP, 0x92);                 // Timer 5 Capture
SFR16 (TMR3, 0x94);                    // Timer 3 Capture / Reload
SFR16 (TMR5, 0x94);                    // Timer 5
SFR16 (SBRL0, 0xAC);                   // UART0 Reload
SFR16 (ADC0, 0xBD);                    // ADC0 data
SFR16 (ADC0GT, 0xC3);                  // ADC0 Greater Than Window
SFR16 (ADC0LT, 0xC5);                  // ADC0 Less Than Window
SFR16 (TMR2RL, 0xCA);                  // Timer 2 Reload
SFR16 (TMR4CAP, 0xCA);                 // Timer 4 Capture
SFR16 (TMR2, 0xCC);                    // Timer 2 Capture / Reload
SFR16 (TMR4, 0xCC);                    // Timer 4
SFR16 (PCA0CP5, 0xCE);                 // PCA0 Module 5 Capture
SFR16 (PCA1CP11, 0xCE);                // PCA1 Module 11 Capture
SFR16 (PCA0CP1, 0xE9);                 // PCA0 Module 1 Capture
SFR16 (PCA1CP7, 0xE9);                 // PCA1 Module 7 Capture
SFR16 (PCA0CP2, 0xEB);                 // PCA0 Module 2 Capture
SFR16 (PCA1CP8, 0xEB);                 // PCA1 Module 8 Capture
SFR16 (PCA0CP3, 0xED);                 // PCA0 Module 3 Capture
SFR16 (PCA1CP9, 0xED);                 // PCA1 Module 9 Capture
SFR16 (PCA0, 0xF9);                    // PCA0 Counter
SFR16 (PCA1, 0xF9);                    // PCA1 Counter
SFR16 (PCA0CP0, 0xFB);                 // PCA0 Module 0 Capture
SFR16 (PCA1CP6, 0xFB);                 // PCA1 Module 6 Capture
SFR16 (PCA0CP4, 0xFD);                 // PCA0 Module 4 Capture
SFR16 (PCA1CP10, 0xFD);                 // PCA1 Module 10 Capture

SFR16 (CAN0ERR, 0x96);                 // Error Counter
SFR16 (CAN0BT, 0x9A);                  // Bit Timing Register
SFR16 (CAN0IID, 0x9C);                 // Interrupt Register
SFR16 (CAN0TR1, 0xA2);                 // Transmission Request 1
SFR16 (CAN0TR2, 0xA4);                 // Transmission Request 2
SFR16 (CAN0ND1, 0xAA);                 // New Data 1
SFR16 (CAN0ND2, 0xAC);                 // New Data 2
SFR16 (CAN0IP1, 0xAE);                 // Interrupt Pending 1
SFR16 (CAN0IP2, 0xB2);                 // Interrupt Pending 2
SFR16 (CAN0MV1, 0xBA);                 // Message Valid 1
SFR16 (CAN0MV2, 0xBC);                 // Message Valid 2
SFR16 (CAN0IF1CR, 0xBE);               // IF1 Command Request
SFR16 (CAN0IF1CM, 0xC2);               // IF1 Command Mask
SFR16 (CAN0IF1M1, 0xC4);               // IF1 Mask 1
SFR16 (CAN0IF1M2, 0xC6);               // IF1 Mask 2
SFR16 (CAN0IF1A1, 0xCA);               // IF1 Arbitration 1
SFR16 (CAN0IF1A2, 0xCC);               // IF1 Arbitration 2
SFR16 (CAN0IF1MC, 0xD2);               // IF1 Message Control
SFR16 (CAN0IF1DA1, 0xD4);              // IF1 Data A 1
SFR16 (CAN0IF1DA2, 0xD6);              // IF1 Data A 2
SFR16 (CAN0IF1DB1, 0xDA);              // IF1 Data B 1
SFR16 (CAN0IF1DB2, 0xDC);              // IF1 Data B 2
SFR16 (CAN0IF2CR, 0xDE);               // IF2 Command Request
SFR16 (CAN0IF2CM, 0xE2);               // IF2 Command Mask
SFR16 (CAN0IF2M1, 0xEA);               // IF2 Mask 1
SFR16 (CAN0IF2M2, 0xEC);               // IF2 Mask 2
SFR16 (CAN0IF2A1, 0xEE);               // IF2 Arbitration 1
SFR16 (CAN0IF2A2, 0xF2);               // IF2 Arbitration 2
SFR16 (CAN0IF2MC, 0xF4);               // IF2 Message Control
SFR16 (CAN0IF2DA1, 0xF6);              // IF2 Data A 1
SFR16 (CAN0IF2DA2, 0xFA);              // IF2 Data A 2
SFR16 (CAN0IF2DB1, 0xFC);              // IF2 Data B 1
SFR16 (CAN0IF2DB2, 0xFE);              // IF2 Data B 2

